URLShortener/app/models/shortened_url.rb

  def self.create!(user, long_url)
    ShortenedUrl.create(long_url: long_url, short_url: ShortenedUrl.random_code, user_id: user.id)
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def self.random_code
    url_code = SecureRandom.urlsafe_base64
    while ShortenedUrl.exists?(:short_url => url_code)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "C63IYaxLFVQLJd4DpOzvOQ"], ["LIMIT", 1]]